TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
/**
  ******************************************************************************
  * @file    gpio.c
  * @brief Sidewalk GPIO PAL implementation for STM32WBAxx
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

/* Sidewalk interfaces */
#include <sid_pal_gpio_ifc.h>
#include <sid_pal_assert_ifc.h>
#include <sid_pal_log_ifc.h>
#include "sid_pal_gpio_ext_ifc.h"

/* Platform interfaces */
#include "stm32wbaxx_ll_gpio.h"
#include "stm32wbaxx_hal_exti.h"
#include "stm32wbaxx_hal_pwr.h"
#include "stm32wbaxx_ll_exti.h"

/* Utilities */
#include <sid_stm32_common_utils.h>

/* LPM handling */
#include "app_conf.h"

/* Private typedef -----------------------------------------------------------*/

/**
 * @brief Configuration of the user-defined callbacks for GPIO-triggered interrupts
 */
typedef struct {
    sid_pal_gpio_irq_handler_t callback;     /*!< User-defined callback to be invoked whenever the associated GPIo IRQ occurs */
    void *                     callback_arg; /*!< User-defined argument to be passed to the callback */
    uint32_t                   gpio_number;  /*!< Associated GPIO pin (in Sidewalk format). This defines both the associated GPIO port and pin number on that port */
    sid_pal_gpio_irq_trigger_t trigger;      /*!< Trigger mode for the GPIO IRQ. Used for software emulation of voltage level-based triggers (SID_PAL_GPIO_IRQ_TRIGGER_LOW and SID_PAL_GPIO_IRQ_TRIGGER_HIGH) as there's no native support for it on STM32WBA */
} gpio_irq_callback_cfg_t;

/* Private defines -----------------------------------------------------------*/

#ifndef SID_PAL_GPIO_STM32_RESERVE_RTC_WAKEUP_LINE
#  define SID_PAL_GPIO_STM32_RESERVE_RTC_WAKEUP_LINE (CFG_LPM_STDBY_SUPPORTED != 0u) /*!< True: Reserve the PWR Wakeup line that is shared with RTC and do not allow GPIO pins to use this line as a wakeup source; False - GPIO pins can use the shared Wakeup line */
#endif /* SID_PAL_GPIO_STM32_RESERVE_RTC_WAKEUP_LINE */

#if defined(STM32WBA)
#  define GPIO_PINS_PER_PORT                         (16u)
#else
#  error "This implementation applies to the STM32WBAxx MCU family only"
#endif

#define SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW  (0u)
#define SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_HIGH (1u)

/* Private macro -------------------------------------------------------------*/

#ifndef SID_PAL_GPIO_STM32WBAxx_EXTRA_LOGGING
/* Set SID_PAL_GPIO_STM32WBAxx_EXTRA_LOGGING to 1 to enable extended logs */
#  define SID_PAL_GPIO_STM32WBAxx_EXTRA_LOGGING      (0)
#endif

#if defined(SID_PAL_GPIO_STM32WBAxx_EXTRA_LOGGING) && SID_PAL_GPIO_STM32WBAxx_EXTRA_LOGGING
#  define SID_PAL_GPIO_STM32_LOG_ERROR(...)          SID_PAL_LOG_ERROR(__VA_ARGS__)
#  define SID_PAL_GPIO_STM32_LOG_WARNING(...)        SID_PAL_LOG_WARNING(__VA_ARGS__)
#  define SID_PAL_GPIO_STM32_LOG_INFO(...)           SID_PAL_LOG_INFO(__VA_ARGS__)
#  define SID_PAL_GPIO_STM32_LOG_DEBUG(...)          SID_PAL_LOG_DEBUG(__VA_ARGS__)
#  define SID_PAL_GPIO_STM32_LOG_TRACE(...)          SID_PAL_LOG_TRACE(__VA_ARGS__)
#else
#  define SID_PAL_GPIO_STM32_LOG_ERROR(...)          ((void)0u)
#  define SID_PAL_GPIO_STM32_LOG_WARNING(...)        ((void)0u)
#  define SID_PAL_GPIO_STM32_LOG_INFO(...)           ((void)0u)
#  define SID_PAL_GPIO_STM32_LOG_DEBUG(...)          ((void)0u)
#  define SID_PAL_GPIO_STM32_LOG_TRACE(...)          ((void)0u)
#endif

#if defined(STM32WBA)
#  define GET_GPIO_PIN_IRQN(gpio_pin)                ((((gpio_pin) >= GPIO_PIN_0) && ((gpio_pin) <= GPIO_PIN_15)) \
                                                     ? (EXTI0_IRQn + GET_GPIO_PIN_POSITION((gpio_pin))) \
                                                     : 0u)

#  define GET_LL_EXTI_LINE(gpio_pin)                 ((((gpio_pin) >= GPIO_PIN_0) && ((gpio_pin) <= GPIO_PIN_15)) \
                                                     ? (1UL << GET_GPIO_PIN_POSITION((gpio_pin))) \
                                                     : 0u)

#  define GET_LL_EXTI_CONFIG_PIN(pin_num)            ( ( ( (GET_GPIO_PIN_POSITION(pin_num) & 0x3u) << 3) << LL_EXTI_REGISTER_PINPOS_SHFT) | (GET_GPIO_PIN_POSITION(pin_num) >> 2) )

/* RTC wakeup line definition */
#  if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
#    define RTC_PWR_WAKEUP_FLAG                       (PWR_WAKEUP_FLAG6) /*!< RTC: Wakeup pin 6 (high polarity) */
#  else
#    define RTC_PWR_WAKEUP_FLAG                       (PWR_WAKEUP_FLAG7) /*!< RTC: Wakeup pin 7 (high polarity) */
#endif /* (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/* GPIO wakeup line definitions */
#define GPIO_WAKEUP_LINES                            (8u)

/* GPIO port definitions */
#  if defined(STM32WBA50xx) || defined(STM32WBA52xx) || defined(STM32WBA54xx) || defined(STM32WBA55xx) || defined(STM32WBA5Mxx) || defined(STM32WBA63xx)
#    define GET_LL_EXTI_CONFIG_PORT(port_num)        ( \
                                                     ((port_num) == GPIOA) ? LL_EXTI_CONFIG_PORTA : \
                                                     ((port_num) == GPIOB) ? LL_EXTI_CONFIG_PORTB : \
                                                     ((port_num) == GPIOC) ? LL_EXTI_CONFIG_PORTC : \
                                                     ((port_num) == GPIOH) ? LL_EXTI_CONFIG_PORTH : 0u)

#    define IS_GPIO_CLK_ENABLED(port_num)            ( \
                                                     ((port_num) == GPIOA) ? __HAL_RCC_GPIOA_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOB) ? __HAL_RCC_GPIOB_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOC) ? __HAL_RCC_GPIOC_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOH) ? __HAL_RCC_GPIOH_IS_CLK_ENABLED() : 0u)

#    define NUM_TO_GPIO_PORT_STR(num)                ( \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTA) ? "A" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTB) ? "B" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTC) ? "C" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTH) ? "H" : "unknown")

#    define NUM_TO_PWR_GPIO_PORT(num)                ( \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTA) ? PWR_GPIO_A : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTB) ? PWR_GPIO_B : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTC) ? PWR_GPIO_C : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTH) ? PWR_GPIO_H : 0xFFu)
#  elif defined(STM32WBA64xx)
#    define GET_LL_EXTI_CONFIG_PORT(port_num)        (\
                                                     ((port_num) == GPIOA) ? LL_EXTI_CONFIG_PORTA : \
                                                     ((port_num) == GPIOB) ? LL_EXTI_CONFIG_PORTB : \
                                                     ((port_num) == GPIOC) ? LL_EXTI_CONFIG_PORTC : \
                                                     ((port_num) == GPIOD) ? LL_EXTI_CONFIG_PORTD : \
                                                     ((port_num) == GPIOH) ? LL_EXTI_CONFIG_PORTH : 0u)

#    define IS_GPIO_CLK_ENABLED(port_num)            ( \
                                                     ((port_num) == GPIOA) ? __HAL_RCC_GPIOA_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOB) ? __HAL_RCC_GPIOB_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOC) ? __HAL_RCC_GPIOC_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOD) ? __HAL_RCC_GPIOD_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOH) ? __HAL_RCC_GPIOH_IS_CLK_ENABLED() : 0u)

#    define NUM_TO_GPIO_PORT_STR(num)                ( \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTA) ? "A" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTB) ? "B" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTC) ? "C" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTD) ? "D" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTH) ? "H" : "unknown")

#    define NUM_TO_PWR_GPIO_PORT(num)                ( \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTA) ? PWR_GPIO_A : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTB) ? PWR_GPIO_B : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTC) ? PWR_GPIO_C : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTD) ? PWR_GPIO_D : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTH) ? PWR_GPIO_H : 0xFFu)
#  elif defined(STM32WBA62xx) || defined(STM32WBA65xx) || defined(STM32WBA6Mxx)
#    define GET_LL_EXTI_CONFIG_PORT(port_num)        (\
                                                     ((port_num) == GPIOA) ? LL_EXTI_CONFIG_PORTA : \
                                                     ((port_num) == GPIOB) ? LL_EXTI_CONFIG_PORTB : \
                                                     ((port_num) == GPIOC) ? LL_EXTI_CONFIG_PORTC : \
                                                     ((port_num) == GPIOD) ? LL_EXTI_CONFIG_PORTD : \
                                                     ((port_num) == GPIOE) ? LL_EXTI_CONFIG_PORTE : \
                                                     ((port_num) == GPIOG) ? LL_EXTI_CONFIG_PORTG : \
                                                     ((port_num) == GPIOH) ? LL_EXTI_CONFIG_PORTH : 0u)

#    define IS_GPIO_CLK_ENABLED(port_num)            ( \
                                                     ((port_num) == GPIOA) ? __HAL_RCC_GPIOA_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOB) ? __HAL_RCC_GPIOB_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOC) ? __HAL_RCC_GPIOC_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOD) ? __HAL_RCC_GPIOD_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOE) ? __HAL_RCC_GPIOE_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOG) ? __HAL_RCC_GPIOG_IS_CLK_ENABLED() : \
                                                     ((port_num) == GPIOH) ? __HAL_RCC_GPIOH_IS_CLK_ENABLED() : 0u)

#    define NUM_TO_GPIO_PORT_STR(num)                ( \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTA) ? "A" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTB) ? "B" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTC) ? "C" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTD) ? "D" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTE) ? "E" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTG) ? "G" : \
                                                     (NUM_TO_GPIO_PORT((num)) == GPIO_PORTH) ? "H" : "unknown")

#    define NUM_TO_PWR_GPIO_PORT(num)                ( \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTA) ? PWR_GPIO_A : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTB) ? PWR_GPIO_B : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTC) ? PWR_GPIO_C : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTD) ? PWR_GPIO_D : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTE) ? PWR_GPIO_E : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTG) ? PWR_GPIO_G : \
                                                     (NUM_TO_GPIO_PORT(num) == GPIO_PORTH) ? PWR_GPIO_H : 0xFFu)
#  else
#    error "Unknown STM32WBA device"
#  endif /* STM32WBAxx - GPIO port definitions */
#else
#  error "This implementation applies to the STM32WBAxx MCU family only"
#endif /* STM32WBA */

/* Private variables ---------------------------------------------------------*/

/* Pool for sid_pall callbacks */
static gpio_irq_callback_cfg_t sid_pal_gpio_irq_callbacks[GPIO_PINS_PER_PORT] = {0};
#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
static gpio_irq_callback_cfg_t sid_pal_gpio_wakeup_callbacks[GPIO_WAKEUP_LINES] = {0};
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

