TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
/* Private function prototypes -----------------------------------------------*/

static inline void        register_gpio_irq_callback(const uint32_t gpio_number, const sid_pal_gpio_irq_trigger_t irq_trigger, const sid_pal_gpio_irq_handler_t callback, void * const callback_arg);
static inline void        deregister_gpio_irq_callback(const uint32_t gpio_number);
static inline void        gpio_clk_check_and_enable(const GPIO_TypeDef * const st_port);
#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
static        sid_error_t get_pwr_wakeup_pin_flag(const uint32_t gpio_number, const uint32_t wakeup_polarity, uint32_t * const out_wakeup_pin, uint32_t * const out_wakeup_flag);
static inline uint32_t    get_wakeup_source_index_from_flag(const uint32_t wakeup_flag);
static inline uint32_t    get_wakeup_source_index_from_pin(const uint32_t wakeup_pin);
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void register_gpio_irq_callback(const uint32_t gpio_number, const sid_pal_gpio_irq_trigger_t irq_trigger, const sid_pal_gpio_irq_handler_t callback, void * const callback_arg)
{
    const uint32_t pin_index = GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number));

    SID_PAL_ASSERT(pin_index < SID_STM32_UTIL_ARRAY_SIZE(sid_pal_gpio_irq_callbacks));

    /**
     * Disable all interrupts when reconfiguring GPIO IRQs. Don't use sid_pal_enter_critical_region() here since a true critical section is needed here,
     * but sid_pal_enter_critical_region() may disable only some interrupts, depending on implementation
     */
    const uint32_t primask_bit = __get_PRIMASK();
    __disable_irq();

    sid_pal_gpio_irq_callbacks[pin_index].callback     = callback;
    sid_pal_gpio_irq_callbacks[pin_index].callback_arg = callback_arg;
    sid_pal_gpio_irq_callbacks[pin_index].gpio_number  = gpio_number;
    sid_pal_gpio_irq_callbacks[pin_index].trigger      = irq_trigger;

    __set_PRIMASK(primask_bit);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void deregister_gpio_irq_callback(const uint32_t gpio_number)
{
    const uint32_t pin_index = GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number));

    SID_PAL_ASSERT(pin_index < GPIO_PINS_PER_PORT);

    /**
     * Disable all interrupts when reconfiguring GPIO IRQs. Don't use sid_pal_enter_critical_region() here since a true critical section is needed here,
     * but sid_pal_enter_critical_region() may disable only some interrupts, depending on implementation
     */
    const uint32_t primask_bit = __get_PRIMASK();
    __disable_irq();

    SID_STM32_UTIL_fast_memset(&sid_pal_gpio_irq_callbacks[pin_index], 0x00u, sizeof(sid_pal_gpio_irq_callbacks[pin_index]));

    __set_PRIMASK(primask_bit);
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void gpio_clk_check_and_enable(const GPIO_TypeDef * const st_port)
{
    /* IMPORTNAT: while normally it's not a good idea to use switch() with pointers, here it is fine since
     * pointers to the GPIO ports are constant and they cannot be changed during the runtime. For this special
     * case using the switch() may gain some performance benefits over if()...else if()...else() construct
     */
    switch ((uint32_t)(void*)st_port)
    {
#ifdef GPIOA
        case (uint32_t)(void *)GPIOA:
            if (!__HAL_RCC_GPIOA_IS_CLK_ENABLED())
            {
                __HAL_RCC_GPIOA_CLK_ENABLE();
            }
            break;
#endif /* GPIOA */

#ifdef GPIOB
        case (uint32_t)(void *)GPIOB:
            if (!__HAL_RCC_GPIOB_IS_CLK_ENABLED())
            {
                __HAL_RCC_GPIOB_CLK_ENABLE();
            }
            break;
#endif /* GPIOB */

#ifdef GPIOC
        case (uint32_t)(void *)GPIOC:
            if (!__HAL_RCC_GPIOC_IS_CLK_ENABLED())
            {
                __HAL_RCC_GPIOC_CLK_ENABLE();
            }
            break;
#endif /* GPIOC */

#ifdef GPIOD
        case (uint32_t)(void *)GPIOD:
            if (!__HAL_RCC_GPIOD_IS_CLK_ENABLED())
            {
                __HAL_RCC_GPIOD_CLK_ENABLE();
            }
            break;
#endif /* GPIOD */

#ifdef GPIOE
        case (uint32_t)(void *)GPIOE:
            if (!__HAL_RCC_GPIOE_IS_CLK_ENABLED())
            {
                __HAL_RCC_GPIOE_CLK_ENABLE();
            }
            break;
#endif /* GPIOE */

#ifdef GPIOG
        case (uint32_t)(void *)GPIOG:
            if (!__HAL_RCC_GPIOG_IS_CLK_ENABLED())
            {
                __HAL_RCC_GPIOG_CLK_ENABLE();
            }
            break;
#endif /* GPIOG */

#ifdef GPIOH
        case (uint32_t)(void *)GPIOH:
            if (!__HAL_RCC_GPIOH_IS_CLK_ENABLED())
            {
                __HAL_RCC_GPIOH_CLK_ENABLE();
            }
            break;
#endif /* GPIOH */

        default:
            SID_PAL_LOG_ERROR("gpio_clk_check_and_enable() failed - unknown GPIO port referenced (0x%08X)", (uint32_t)(void *)st_port);
            break;
    }
}

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED static sid_error_t get_pwr_wakeup_pin_flag(const uint32_t gpio_number, const uint32_t wakeup_polarity, uint32_t * const out_wakeup_pin, uint32_t * const out_wakeup_flag)
{
    sid_error_t err = SID_ERROR_NONE;

    switch (gpio_number)
    {
#if defined(PWR_WUCR1_WUPEN1) && defined(PWR_WAKEUP1_SOURCE_SELECTION_0)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_0):
            *out_wakeup_pin = PWR_WUCR1_WUPEN1 | PWR_WAKEUP1_SOURCE_SELECTION_0;
            *out_wakeup_flag = PWR_WAKEUP_FLAG1;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP1_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN1 && PWR_WAKEUP1_SOURCE_SELECTION_0 */

#if defined(PWR_WUCR1_WUPEN1) && defined(PWR_WAKEUP1_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOB, GPIO_PIN_2):
            *out_wakeup_pin = PWR_WUCR1_WUPEN1 | PWR_WAKEUP1_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG1;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP1_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN1 && PWR_WAKEUP1_SOURCE_SELECTION_1 */

#if defined(PWR_WUCR1_WUPEN2) && defined(PWR_WAKEUP2_SOURCE_SELECTION_0)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_4):
            *out_wakeup_pin = PWR_WUCR1_WUPEN2 | PWR_WAKEUP2_SOURCE_SELECTION_0;
            *out_wakeup_flag = PWR_WAKEUP_FLAG2;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP2_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN2 && PWR_WAKEUP2_SOURCE_SELECTION_0 */

#if defined(PWR_WUCR1_WUPEN2) && defined(PWR_WAKEUP2_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOC, GPIO_PIN_13):
            *out_wakeup_pin = PWR_WUCR1_WUPEN2 | PWR_WAKEUP2_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG2;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP2_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN2 && PWR_WAKEUP2_SOURCE_SELECTION_1 */

#if defined(PWR_WUCR1_WUPEN3) && defined(PWR_WAKEUP3_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_1):
            *out_wakeup_pin = PWR_WUCR1_WUPEN3 | PWR_WAKEUP3_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG3;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP3_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN3 && PWR_WAKEUP3_SOURCE_SELECTION_1 */

#if defined(PWR_WUCR1_WUPEN3) && defined(PWR_WAKEUP3_SOURCE_SELECTION_2)
        case GPIO_PORT_PIN_TO_NUM(GPIOB, GPIO_PIN_6):
            *out_wakeup_pin = PWR_WUCR1_WUPEN3 | PWR_WAKEUP3_SOURCE_SELECTION_2;
            *out_wakeup_flag = PWR_WAKEUP_FLAG3;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP3_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN3 && PWR_WAKEUP3_SOURCE_SELECTION_2 */

#if defined(PWR_WUCR1_WUPEN4) && defined(PWR_WAKEUP4_SOURCE_SELECTION_0)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_2):
            *out_wakeup_pin = PWR_WUCR1_WUPEN4 | PWR_WAKEUP4_SOURCE_SELECTION_0;
            *out_wakeup_flag = PWR_WAKEUP_FLAG4;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP4_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN4 && PWR_WAKEUP4_SOURCE_SELECTION_0 */

#if defined(PWR_WUCR1_WUPEN4) && defined(PWR_WAKEUP4_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOB, GPIO_PIN_1):
            *out_wakeup_pin = PWR_WUCR1_WUPEN4 | PWR_WAKEUP4_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG4;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP4_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN4 && PWR_WAKEUP4_SOURCE_SELECTION_1 */

#if defined(PWR_WUCR1_WUPEN5) && defined(PWR_WAKEUP5_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_3):
            *out_wakeup_pin = PWR_WUCR1_WUPEN5 | PWR_WAKEUP5_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG5;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP5_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN5 && PWR_WAKEUP5_SOURCE_SELECTION_1 */

#if defined(PWR_WUCR1_WUPEN5) && defined(PWR_WAKEUP5_SOURCE_SELECTION_2)
        case GPIO_PORT_PIN_TO_NUM(GPIOB, GPIO_PIN_7):
            *out_wakeup_pin = PWR_WUCR1_WUPEN5 | PWR_WAKEUP5_SOURCE_SELECTION_2;
            *out_wakeup_flag = PWR_WAKEUP_FLAG5;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP5_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN5 && PWR_WAKEUP5_SOURCE_SELECTION_2 */

#if defined(PWR_WUCR1_WUPEN6) && defined(PWR_WAKEUP6_SOURCE_SELECTION_0)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_12):
            *out_wakeup_pin = PWR_WUCR1_WUPEN6 | PWR_WAKEUP6_SOURCE_SELECTION_0;
            *out_wakeup_flag = PWR_WAKEUP_FLAG6;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP6_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN6 && PWR_WAKEUP6_SOURCE_SELECTION_0 */

#if defined(PWR_WUCR1_WUPEN6) && defined(PWR_WAKEUP6_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_5):
            *out_wakeup_pin = PWR_WUCR1_WUPEN6 | PWR_WAKEUP6_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG6;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP6_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN6 && PWR_WAKEUP6_SOURCE_SELECTION_1 */

