TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
#if defined(PWR_WUCR1_WUPEN7) && defined(PWR_WAKEUP7_SOURCE_SELECTION_0)
        case GPIO_PORT_PIN_TO_NUM(GPIOB, GPIO_PIN_14):
            *out_wakeup_pin = PWR_WUCR1_WUPEN7 | PWR_WAKEUP7_SOURCE_SELECTION_0;
            *out_wakeup_flag = PWR_WAKEUP_FLAG7;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP7_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN7 && PWR_WAKEUP7_SOURCE_SELECTION_0 */

#if defined(PWR_WUCR1_WUPEN7) && defined(PWR_WAKEUP7_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_6):
            *out_wakeup_pin = PWR_WUCR1_WUPEN7 | PWR_WAKEUP7_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG7;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP7_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN7 && PWR_WAKEUP7_SOURCE_SELECTION_1 */

#if defined(PWR_WUCR1_WUPEN8) && defined(PWR_WAKEUP8_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOA, GPIO_PIN_7):
            *out_wakeup_pin = PWR_WUCR1_WUPEN8 | PWR_WAKEUP8_SOURCE_SELECTION_1;
            *out_wakeup_flag = PWR_WAKEUP_FLAG8;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP8_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN8 && PWR_WAKEUP8_SOURCE_SELECTION_1 */

#if defined(PWR_WUCR1_WUPEN8) && defined(PWR_WAKEUP1_SOURCE_SELECTION_1)
        case GPIO_PORT_PIN_TO_NUM(GPIOB, GPIO_PIN_9):
            *out_wakeup_pin = PWR_WUCR1_WUPEN8 | PWR_WAKEUP8_SOURCE_SELECTION_2;
            *out_wakeup_flag = PWR_WAKEUP_FLAG8;
            if (SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW == wakeup_polarity)
            {
                *out_wakeup_pin |= PWR_WAKEUP8_POLARITY_LOW;
            }
            break;
#endif /* PWR_WUCR1_WUPEN8 && PWR_WAKEUP8_SOURCE_SELECTION_2 */

        default:
            err = SID_ERROR_INVALID_ARGS;
            break;
    }

    return err;
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED static inline uint32_t get_wakeup_source_index_from_flag(const uint32_t wakeup_flag)
{
    uint32_t wakeup_source_index;

    switch (wakeup_flag)
    {
#  ifdef PWR_WAKEUP_FLAG1
        case PWR_WAKEUP_FLAG1:
            wakeup_source_index = 0u;
            break;
#  endif /* PWR_WAKEUP_FLAG1 */

#  ifdef PWR_WAKEUP_FLAG2
        case PWR_WAKEUP_FLAG2:
            wakeup_source_index = 1u;
            break;
#  endif /* PWR_WAKEUP_FLAG2 */

#  ifdef PWR_WAKEUP_FLAG3
        case PWR_WAKEUP_FLAG3:
            wakeup_source_index = 2u;
            break;
#  endif /* PWR_WAKEUP_FLAG3 */

#  ifdef PWR_WAKEUP_FLAG4
        case PWR_WAKEUP_FLAG4:
            wakeup_source_index = 3u;
            break;
#  endif /* PWR_WAKEUP_FLAG4 */

#  ifdef PWR_WAKEUP_FLAG5
        case PWR_WAKEUP_FLAG5:
            wakeup_source_index = 4u;
            break;
#  endif /* PWR_WAKEUP_FLAG5 */

#  ifdef PWR_WAKEUP_FLAG6
        case PWR_WAKEUP_FLAG6:
            wakeup_source_index = 5u;
            break;
#  endif /* PWR_WAKEUP_FLAG6 */

#  ifdef PWR_WAKEUP_FLAG7
        case PWR_WAKEUP_FLAG7:
            wakeup_source_index = 6u;
            break;
#  endif /* PWR_WAKEUP_FLAG7 */

#  ifdef PWR_WAKEUP_FLAG8
        case PWR_WAKEUP_FLAG8:
            wakeup_source_index = 7u;
            break;
#  endif /* PWR_WAKEUP_FLAG8 */

        default:
        wakeup_source_index = UINT32_MAX;
        break;
    }

    SID_PAL_ASSERT(wakeup_source_index != UINT32_MAX);

    return wakeup_source_index;
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */
/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED static inline uint32_t get_wakeup_source_index_from_pin(const uint32_t wakeup_pin)
{
    uint32_t wakeup_source_index;

    switch (wakeup_pin)
    {
#  ifdef PWR_WAKEUP_PIN1
        case PWR_WAKEUP_PIN1:
            wakeup_source_index = 0u;
            break;
#  endif /* PWR_WAKEUP_PIN1 */

#  ifdef PWR_WAKEUP_PIN2
        case PWR_WAKEUP_PIN2:
            wakeup_source_index = 1u;
            break;
#  endif /* PWR_WAKEUP_PIN2 */

#  ifdef PWR_WAKEUP_PIN3
        case PWR_WAKEUP_PIN3:
            wakeup_source_index = 2u;
            break;
#  endif /* PWR_WAKEUP_PIN3 */

#  ifdef PWR_WAKEUP_PIN4
        case PWR_WAKEUP_PIN4:
            wakeup_source_index = 3u;
            break;
#  endif /* PWR_WAKEUP_PIN4 */

#  ifdef PWR_WAKEUP_PIN5
        case PWR_WAKEUP_PIN5:
            wakeup_source_index = 4u;
            break;
#  endif /* PWR_WAKEUP_PIN5 */

#  ifdef PWR_WAKEUP_PIN6
        case PWR_WAKEUP_PIN6:
            wakeup_source_index = 5u;
            break;
#  endif /* PWR_WAKEUP_PIN6 */

#  ifdef PWR_WAKEUP_PIN7
        case PWR_WAKEUP_PIN7:
            wakeup_source_index = 6u;
            break;
#  endif /* PWR_WAKEUP_PIN7 */

#  ifdef PWR_WAKEUP_PIN8
        case PWR_WAKEUP_PIN8:
            wakeup_source_index = 7u;
            break;
#  endif /* PWR_WAKEUP_PIN8 */

        default:
        wakeup_source_index = UINT32_MAX;
        break;
    }

    SID_PAL_ASSERT(wakeup_source_index != UINT32_MAX);

    return wakeup_source_index;
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/* Global function definitions -----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_set_direction(uint32_t gpio_number, sid_pal_gpio_direction_t direction)
{
    /* If pin is not connected then just ignore it*/
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    gpio_clk_check_and_enable(st_port);

    if (direction > SID_PAL_GPIO_DIRECTION_OUTPUT)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    uint32_t pin_mode;

    if (direction == SID_PAL_GPIO_DIRECTION_INPUT)
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d direction to Input", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        pin_mode = LL_GPIO_MODE_INPUT;
    }
    else
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d direction to Output", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        pin_mode = LL_GPIO_MODE_OUTPUT;
        LL_GPIO_SetPinSpeed(st_port, st_pin, LL_GPIO_SPEED_FREQ_HIGH);
    }

    LL_GPIO_SetPinMode(st_port, st_pin, pin_mode);

