TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_input_mode(uint32_t gpio_number, sid_pal_gpio_input_t mode)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    if (mode > SID_PAL_GPIO_INPUT_DISCONNECT)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    gpio_clk_check_and_enable(st_port);

    uint32_t pin_mode;

    if (mode == SID_PAL_GPIO_INPUT_CONNECT)
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d input mode to Input", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        pin_mode = LL_GPIO_MODE_INPUT;
    }
    else
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d input mode to Analog", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        pin_mode = LL_GPIO_MODE_ANALOG;
    }

    LL_GPIO_SetPinMode(st_port, st_pin, pin_mode);

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_output_mode(uint32_t gpio_number, sid_pal_gpio_output_t mode)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    if (mode > SID_PAL_GPIO_OUTPUT_OPEN_DRAIN)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    gpio_clk_check_and_enable(st_port);

    uint32_t output_type;
    if (mode == SID_PAL_GPIO_OUTPUT_OPEN_DRAIN)
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d output mode to Open Drain", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        output_type = LL_GPIO_OUTPUT_OPENDRAIN;
    }
    else
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d output mode to Push-Pull", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        output_type = LL_GPIO_OUTPUT_PUSHPULL;
    }

    LL_GPIO_SetPinOutputType(st_port, st_pin, output_type);

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_pull_mode(uint32_t gpio_number, sid_pal_gpio_pull_t pull)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    if (pull > SID_PAL_GPIO_PULL_DOWN)
    {
        return SID_ERROR_INVALID_ARGS;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    gpio_clk_check_and_enable(st_port);

    uint32_t pin_pull = LL_GPIO_PULL_NO;
    switch (pull)
    {
        case SID_PAL_GPIO_PULL_NONE:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Disable pull-up & pull-down on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            pin_pull = LL_GPIO_PULL_NO;
            break;

        case SID_PAL_GPIO_PULL_UP:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Enable pull-up on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            pin_pull = LL_GPIO_PULL_UP;
            break;

        case SID_PAL_GPIO_PULL_DOWN:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Enable pull-down on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            pin_pull = LL_GPIO_PULL_DOWN;
            break;

        default:
            SID_PAL_LOG_ERROR("Invalid GPIO pull mode: 0x%02X", pull);
            break;
    }

    LL_GPIO_SetPinPull(st_port, st_pin, pin_pull);

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_read(uint32_t gpio_number, uint8_t *value)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    SID_PAL_ASSERT( false != IS_GPIO_CLK_ENABLED(st_port) );

    if ((st_port->IDR & st_pin) != 0x00u)
    {
        *value = GPIO_PIN_SET;
    }
    else
    {
        *value = GPIO_PIN_RESET;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_write(uint32_t gpio_number, uint8_t value)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    SID_PAL_ASSERT( false != IS_GPIO_CLK_ENABLED(st_port) );

    if (value != GPIO_PIN_RESET)
    {
        st_port->BSRR = (uint32_t)st_pin;
    }
    else
    {
        st_port->BRR = (uint32_t)st_pin;
    }

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_toggle(uint32_t gpio_number)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    SID_PAL_ASSERT( false != IS_GPIO_CLK_ENABLED(st_port) );

    /* get current Output Data Register value */
    uint32_t odr = st_port->ODR;

    /* Set selected pins that were at low level, and reset ones that were high */
    st_port->BSRR = ((odr & st_pin) << GPIO_PINS_PER_PORT) | (~odr & st_pin);

