TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_set_latch(const uint32_t gpio_number, const sid_pal_gpio_irq_trigger_t edge)
{
    sid_error_t err = SID_ERROR_GENERIC;

    if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    gpio_clk_check_and_enable(st_port);
    LL_EXTI_InitTypeDef EXTI_InitStruct = {0};

    uint32_t exti_trigger = LL_EXTI_TRIGGER_NONE;
    switch (edge)
    {
        case SID_PAL_GPIO_IRQ_TRIGGER_NONE:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Configure no EXTI trigger on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            exti_trigger = LL_EXTI_TRIGGER_NONE;
            break;

        case SID_PAL_GPIO_IRQ_TRIGGER_RISING:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Configure EXTI rising edge trigger on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            exti_trigger = LL_EXTI_TRIGGER_RISING;
            break;

        case SID_PAL_GPIO_IRQ_TRIGGER_FALLING:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Configure EXTI falling edge trigger on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            exti_trigger = LL_EXTI_TRIGGER_FALLING;
            break;

        case SID_PAL_GPIO_IRQ_TRIGGER_EDGE:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Configure EXTI rising & falling edges trigger on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            exti_trigger = LL_EXTI_TRIGGER_RISING_FALLING;
            break;

        default:
            SID_PAL_LOG_ERROR("Error configuring P%s%d. 0x%02X is not a valid trigger", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)), (uint32_t)edge);
            break;
    }

    if (SID_PAL_GPIO_IRQ_TRIGGER_NONE == edge)
    {
        EXTI_InitStruct.Line_0_31 = GET_LL_EXTI_LINE(st_pin);
        EXTI_InitStruct.LineCommand = DISABLE;
        EXTI_InitStruct.Mode = LL_EXTI_MODE_IT;
        EXTI_InitStruct.Trigger = exti_trigger;
        LL_EXTI_Init(&EXTI_InitStruct);

        err = SID_ERROR_NONE;
    }
    else if ((edge > SID_PAL_GPIO_IRQ_TRIGGER_NONE) && (edge <= SID_PAL_GPIO_IRQ_TRIGGER_EDGE))
    {
        LL_EXTI_SetEXTISource(GET_LL_EXTI_CONFIG_PORT(st_port), GET_LL_EXTI_CONFIG_PIN(st_pin));

        EXTI_InitStruct.Line_0_31 = GET_LL_EXTI_LINE(st_pin);
        EXTI_InitStruct.LineCommand = ENABLE;
        EXTI_InitStruct.Mode = LL_EXTI_MODE_IT;
        EXTI_InitStruct.Trigger = exti_trigger;
        LL_EXTI_Init(&EXTI_InitStruct);

        err = SID_ERROR_NONE;
    }
    else
    {
        err = SID_ERROR_NOSUPPORT;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_set_irq(uint32_t gpio_number, sid_pal_gpio_irq_trigger_t irq_trigger, sid_pal_gpio_irq_handler_t gpio_callback, void * callback_arg)
{
    sid_error_t err = SID_ERROR_GENERIC;

    if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    const uint32_t irq_num = GET_GPIO_PIN_IRQN(NUM_TO_GPIO_PIN(gpio_number));
    SID_PAL_ASSERT(irq_num != 0u); /* Ensure gpio_number refers to a valid GPIO pin */

    do
    {
        /* Configure EXTI peripheral to generate events on the desired edge(s) */
        switch (irq_trigger)
        {
            case SID_PAL_GPIO_IRQ_TRIGGER_LOW:
                /* Use falling edge EXTI trigger for hardware detection, level-based detection is implemented in software as there's no hardware support for it */
                err = sid_pal_gpio_ext_ifc_set_latch(gpio_number, SID_PAL_GPIO_IRQ_TRIGGER_FALLING);
                break;

            case SID_PAL_GPIO_IRQ_TRIGGER_HIGH:
                /* Use rising edge EXTI trigger for hardware detection, level-based detection is implemented in software as there's no hardware support for it */
                err = sid_pal_gpio_ext_ifc_set_latch(gpio_number, SID_PAL_GPIO_IRQ_TRIGGER_RISING);
                break;

            default:
                /* For any kind of edge transition-based trigger we can use hardware mechanisms directly */
                err = sid_pal_gpio_ext_ifc_set_latch(gpio_number, irq_trigger);
                break;
        }
        if(err != SID_ERROR_NONE)
        {
            break;
        }

        /* Configure NVIC to generate interrupts based on inputs from EXTI */
        if (SID_PAL_GPIO_IRQ_TRIGGER_NONE == irq_trigger)
        {
            err = sid_pal_gpio_irq_disable(gpio_number);
            if (err != SID_ERROR_NONE)
            {
                break;
            }

            /* De-register user callback */
            deregister_gpio_irq_callback(gpio_number);
        }
        else
        {
            /* Assign callback first */
            register_gpio_irq_callback(gpio_number, irq_trigger, gpio_callback, callback_arg);
            __COMPILER_BARRIER();

            /* Set EXTI Interrupt to the default priority */
            HAL_NVIC_SetPriority(irq_num, GPIO_EXTI_DEFAULT_PRIORITY, 0u);

            /* Enable the corresponding IRQ in NVIC */
            err = sid_pal_gpio_irq_enable(gpio_number);
            if (err != SID_ERROR_NONE)
            {
                break;
            }
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_irq_enable(uint32_t gpio_number)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    const uint32_t pin_index = GET_GPIO_PIN_POSITION(st_pin);
    const uint32_t exti_line = GET_LL_EXTI_LINE(st_pin);
    const uint32_t irq_num = GET_GPIO_PIN_IRQN(st_pin);

    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    SID_PAL_ASSERT( false != IS_GPIO_CLK_ENABLED(st_port) );

    if (sid_pal_gpio_irq_callbacks[pin_index].gpio_number == gpio_number)
    {
        if (((SID_PAL_GPIO_IRQ_TRIGGER_LOW == sid_pal_gpio_irq_callbacks[pin_index].trigger) && ((st_port->IDR & st_pin) == 0x00u))
        || ((SID_PAL_GPIO_IRQ_TRIGGER_HIGH == sid_pal_gpio_irq_callbacks[pin_index].trigger) && ((st_port->IDR & st_pin) != 0x00u)))
        {
            /* Software emulation of level-triggered GPIO IRQ - generate SWI if level-based trigger is configured for the pin and pin is at corresponding level when IRQ is activated */
            LL_EXTI_GenerateSWI_0_31(exti_line);
        }
    }
    __COMPILER_BARRIER(); /* Ensure EXTI event flag is set before IRQ line is activated */

    HAL_NVIC_EnableIRQ(irq_num);
    __DSB();
    __ISB();
    __COMPILER_BARRIER();

    /* Once IRQ is enabled the timing constraints are relaxed and we can write something in the log */
    SID_PAL_GPIO_STM32_LOG_DEBUG("Enable EXTI IRQ for P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));

