TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_irq_disable(uint32_t gpio_number)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    SID_PAL_ASSERT( false != IS_GPIO_CLK_ENABLED(st_port) );

    HAL_NVIC_DisableIRQ(GET_GPIO_PIN_IRQN(st_pin));
    __DSB();
    __ISB();
    __COMPILER_BARRIER();

    /* Once IRQ is disabled the timing constraints are relaxed and we can write something in the log */
    SID_PAL_GPIO_STM32_LOG_DEBUG("Disable EXTI IRQ for P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_set_irq_priority(const uint32_t gpio_number, const uint32_t irq_preempt_prio, const uint32_t irq_sub_prio)
{
    if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    SID_PAL_ASSERT( false != IS_GPIO_CLK_ENABLED(st_port) );

    HAL_NVIC_SetPriority(GET_GPIO_PIN_IRQN(st_pin), irq_preempt_prio, irq_sub_prio);
    __DSB();
    __ISB();
    __COMPILER_BARRIER();

    /* Once IRQ priority is configured the timing constraints are relaxed and we can write something in the log */
    SID_PAL_GPIO_STM32_LOG_DEBUG("Set EXTI IRQ priority for P%s%d to %u.%u", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)), irq_preempt_prio, irq_sub_prio);

    return SID_ERROR_NONE;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void sid_pal_gpio_exti_irq_handler(const uint32_t st_pin)
{
    const uint32_t exti_line = GET_LL_EXTI_LINE(st_pin);

    /* Clear Rising and Falling flags in EXTI first to resume edge detection ASAP */
    LL_EXTI_ClearRisingFlag_0_31(exti_line);
    LL_EXTI_ClearFallingFlag_0_31(exti_line);
    /* Ensure all states are fully synchronized before proceeding */
    __DSB();
    __ISB();
    __COMPILER_BARRIER();

    const uint32_t pin_index = GET_GPIO_PIN_POSITION(st_pin);
    SID_PAL_ASSERT(pin_index < GPIO_PINS_PER_PORT);
    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(sid_pal_gpio_irq_callbacks[pin_index].gpio_number);
    const uint32_t irq_num = GET_GPIO_PIN_IRQN(st_pin);

    /* Proceed with user callback invocation if such callback is assigned */
    if (sid_pal_gpio_irq_callbacks[pin_index].callback != NULL)
    {
        /* Call the user-defined callback */
        sid_pal_gpio_irq_callbacks[pin_index].callback(sid_pal_gpio_irq_callbacks[pin_index].gpio_number, sid_pal_gpio_irq_callbacks[pin_index].callback_arg);
    }

    if (
        ( /* Software emulation of the low level-triggered GPIO IRQ */
               (SID_PAL_GPIO_IRQ_TRIGGER_LOW == sid_pal_gpio_irq_callbacks[pin_index].trigger)
            && ((st_port->IDR & st_pin) == 0x00u) /* Pin remains low */
            && (NVIC_GetEnableIRQ(irq_num)) /* Associated IRQ in NVIC remains enabled */
        )
        ||
        ( /* Software emulation of the high level-triggered GPIO IRQ */
               (SID_PAL_GPIO_IRQ_TRIGGER_HIGH == sid_pal_gpio_irq_callbacks[pin_index].trigger)
            && ((st_port->IDR & st_pin) != 0x00u) /* Pin remains high */
            && (NVIC_GetEnableIRQ(irq_num)) /* Associated IRQ in NVIC remains enabled */
        )
    )
    {
        /* Generate an SWI if level-based trigger is configured for the pin and the pin remains at the triggering level even after the user callback invocation */
        LL_EXTI_GenerateSWI_0_31(exti_line);
    }
}

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED void sid_pal_gpio_wakeup_irq_handler(void)
{
    const uint32_t wakeup_pins[] = {
#ifdef PWR_WAKEUP_PIN1
        PWR_WAKEUP_PIN1,
#endif /* PWR_WAKEUP_PIN1 */
#ifdef PWR_WAKEUP_PIN2
        PWR_WAKEUP_PIN2,
#endif /* PWR_WAKEUP_PIN2 */
#ifdef PWR_WAKEUP_PIN3
        PWR_WAKEUP_PIN3,
#endif /* PWR_WAKEUP_PIN3 */
#ifdef PWR_WAKEUP_PIN4
        PWR_WAKEUP_PIN4,
#endif /* PWR_WAKEUP_PIN4 */
#ifdef PWR_WAKEUP_PIN5
        PWR_WAKEUP_PIN5,
#endif /* PWR_WAKEUP_PIN5 */
#ifdef PWR_WAKEUP_PIN6
        PWR_WAKEUP_PIN6,
#endif /* PWR_WAKEUP_PIN6 */
#ifdef PWR_WAKEUP_PIN7
        PWR_WAKEUP_PIN7,
#endif /* PWR_WAKEUP_PIN7 */
#ifdef PWR_WAKEUP_PIN8
        PWR_WAKEUP_PIN8,
#endif /* PWR_WAKEUP_PIN8 */
    };

    const uint32_t active_wakeup_sources = HAL_PWR_GetClearWakeupSource();

    for (uint32_t i = 0u; i < SID_STM32_UTIL_ARRAY_SIZE(wakeup_pins); i++)
    {
        const uint32_t wakeup_source = (active_wakeup_sources & wakeup_pins[i]);

        if (wakeup_source != 0u)
        {
            /* Get wakeup source index */
            const uint32_t wake_source_index = get_wakeup_source_index_from_pin(wakeup_source);
            SID_PAL_ASSERT(wake_source_index < SID_STM32_UTIL_ARRAY_SIZE(sid_pal_gpio_wakeup_callbacks));

            /* Proceed with user callback invocation if such callback is assigned */
            if (sid_pal_gpio_wakeup_callbacks[wake_source_index].callback != NULL)
            {
                /* Call the user-defined callback */
                sid_pal_gpio_wakeup_callbacks[wake_source_index].callback(sid_pal_gpio_wakeup_callbacks[wake_source_index].gpio_number, sid_pal_gpio_wakeup_callbacks[wake_source_index].callback_arg);
            }
        }
    }
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

