TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_check_latch_state(const uint32_t gpio_number, const sid_pal_gpio_irq_trigger_t edge, uint32_t * const is_edge_detected)
{
    sid_error_t err = SID_ERROR_NONE;
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    const uint32_t exti_line = GET_LL_EXTI_LINE(st_pin);

    if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));

    switch (edge)
    {
        case SID_PAL_GPIO_IRQ_TRIGGER_RISING:
            *is_edge_detected = LL_EXTI_IsActiveRisingFlag_0_31(exti_line);
            break;

        case SID_PAL_GPIO_IRQ_TRIGGER_FALLING:
            *is_edge_detected = LL_EXTI_IsActiveFallingFlag_0_31(exti_line);
            break;

        case SID_PAL_GPIO_IRQ_TRIGGER_EDGE:
            *is_edge_detected = (LL_EXTI_IsActiveRisingFlag_0_31(exti_line) || LL_EXTI_IsActiveFallingFlag_0_31(exti_line));
            break;

        default:
            err = SID_ERROR_NOSUPPORT;
            break;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_clear_latch_state(const uint32_t gpio_number, const sid_pal_gpio_irq_trigger_t edge)
{
    sid_error_t err = SID_ERROR_NONE;
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    const uint32_t exti_line = GET_LL_EXTI_LINE(st_pin);

    if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        err = SID_ERROR_NONE;
    }

    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));

    switch (edge)
    {
        case SID_PAL_GPIO_IRQ_TRIGGER_RISING:
            LL_EXTI_ClearRisingFlag_0_31(exti_line);
            break;

        case SID_PAL_GPIO_IRQ_TRIGGER_FALLING:
            LL_EXTI_ClearFallingFlag_0_31(exti_line);
            break;

        case SID_PAL_GPIO_IRQ_TRIGGER_EDGE:
            LL_EXTI_ClearRisingFlag_0_31(exti_line);
            LL_EXTI_ClearFallingFlag_0_31(exti_line);
            break;

        default:
            err = SID_ERROR_NOSUPPORT;
            break;
    }

    return err;
}

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_wakeup_enable(const uint32_t gpio_number, const sid_pal_gpio_irq_trigger_t edge, const sid_pal_gpio_irq_handler_t callback, void * const callback_arg)
{
    sid_error_t err;
    HAL_StatusTypeDef hal_ret;
    uint32_t pwr_wakeup_pin;
    uint32_t pwr_wakeup_flag;

    do
    {
        if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
        {
            err = SID_ERROR_NONE;
            break;
        }

        if ((edge != SID_PAL_GPIO_IRQ_TRIGGER_RISING) && (edge != SID_PAL_GPIO_IRQ_TRIGGER_FALLING))
        {
            err = SID_ERROR_INVALID_ARGS;
            break;
        }

        const uint32_t wakeup_polarity = (SID_PAL_GPIO_IRQ_TRIGGER_FALLING == edge) ? SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_LOW : SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_HIGH;

        err = get_pwr_wakeup_pin_flag(gpio_number, wakeup_polarity, &pwr_wakeup_pin, &pwr_wakeup_flag);
        if (err != SID_ERROR_NONE)
        {
            break;
        }

#if SID_PAL_GPIO_STM32_RESERVE_RTC_WAKEUP_LINE
        if (RTC_PWR_WAKEUP_FLAG == pwr_wakeup_flag)
        {
            /* The GPIO pin shares the wakeup line with RTC, and RTC wakeup is in use */
            err = SID_ERROR_BUSY;
            break;
        }
#endif /* SID_PAL_GPIO_STM32_RESERVE_RTC_WAKEUP_LINE */

        const uint32_t pwr_gpio_port = NUM_TO_PWR_GPIO_PORT(gpio_number);
        const uint16_t pwr_gpio_pin = (uint16_t)NUM_TO_GPIO_PIN(gpio_number);

        /* Enable GPIO retention for the selected wakeup pin */
        hal_ret = HAL_PWREx_EnableStandbyIORetention(pwr_gpio_port, pwr_gpio_pin);
        if (hal_ret != HAL_OK)
        {
            err = SID_ERROR_GENERIC;
            break;
        }

        /* Set the callback for the selected pin */
        const uint32_t wake_source_index = get_wakeup_source_index_from_flag(pwr_wakeup_flag);

        SID_PAL_ASSERT(wake_source_index < SID_STM32_UTIL_ARRAY_SIZE(sid_pal_gpio_wakeup_callbacks));

        /**
         * Disable all interrupts when reconfiguring GPIO IRQs. Don't use sid_pal_enter_critical_region() here since a true critical section is needed here,
         * but sid_pal_enter_critical_region() may disable only some interrupts, depending on implementation
         */
        const uint32_t primask_bit = __get_PRIMASK();
        __disable_irq();

        sid_pal_gpio_wakeup_callbacks[wake_source_index].callback     = callback;
        sid_pal_gpio_wakeup_callbacks[wake_source_index].callback_arg = callback_arg;
        sid_pal_gpio_wakeup_callbacks[wake_source_index].gpio_number  = gpio_number;
        sid_pal_gpio_wakeup_callbacks[wake_source_index].trigger      = edge;

        __set_PRIMASK(primask_bit);

        /* Enable wakeup for the selected pin and trigger edge */
        HAL_PWR_EnableWakeUpPin(pwr_wakeup_pin);

        /* Clear wakeup flag for the selected pin in PWR */
        __HAL_PWR_CLEAR_FLAG(pwr_wakeup_flag);

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_wakeup_disable(const uint32_t gpio_number)
{
    sid_error_t err;
    uint32_t pwr_wakeup_pin;
    uint32_t pwr_wakeup_flag;

    do
    {
        if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
        {
            err = SID_ERROR_NONE;
            break;
        }

        err = get_pwr_wakeup_pin_flag(gpio_number, SID_PAL_GPIO_STM32WBAxx_WAKEUP_POLARITY_HIGH, &pwr_wakeup_pin, &pwr_wakeup_flag); /* The actual polarity doesn't matter here */
        if (err != SID_ERROR_NONE)
        {
            break;
        }

