TrangLu1999/STM32-Sidewalk-SDK-main/pal/st/stm32wba/sid_pal/gpio.c
#if SID_PAL_GPIO_STM32_RESERVE_RTC_WAKEUP_LINE
        if (RTC_PWR_WAKEUP_FLAG == pwr_wakeup_flag)
        {
            /* The GPIO pin shares the wakeup line with RTC, and RTC wakeup is in use */
            err = SID_ERROR_BUSY;
            break;
        }
#endif /* SID_PAL_GPIO_STM32_RESERVE_RTC_WAKEUP_LINE */

        /* Clear the callback for the selected pin */
        const uint32_t wake_source_index = get_wakeup_source_index_from_flag(pwr_wakeup_flag);

        SID_PAL_ASSERT(wake_source_index < SID_STM32_UTIL_ARRAY_SIZE(sid_pal_gpio_wakeup_callbacks));

        /**
         * Disable all interrupts when reconfiguring GPIO IRQs. Don't use sid_pal_enter_critical_region() here since a true critical section is needed here,
         * but sid_pal_enter_critical_region() may disable only some interrupts, depending on implementation
         */
        const uint32_t primask_bit = __get_PRIMASK();
        __disable_irq();

        SID_STM32_UTIL_fast_memset(&sid_pal_gpio_wakeup_callbacks[wake_source_index], 0x00u, sizeof(sid_pal_gpio_wakeup_callbacks[wake_source_index]));

        __set_PRIMASK(primask_bit);

        /* Disable wakeup for the selected pin and trigger edge */
        HAL_PWR_DisableWakeUpPin(pwr_wakeup_pin);

        /* Clear wakeup flag for the selected pin in PWR */
        __HAL_PWR_CLEAR_FLAG(pwr_wakeup_flag);

       /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_standby_retention_enable(const uint32_t gpio_number)
{
    sid_error_t err;
    HAL_StatusTypeDef hal_ret;

    do
    {
        if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
        {
            err = SID_ERROR_NONE;
            break;
        }

        const uint32_t pwr_gpio_port = NUM_TO_PWR_GPIO_PORT(gpio_number);
        const uint16_t pwr_gpio_pin = (uint16_t)NUM_TO_GPIO_PIN(gpio_number);

        /* Enable GPIO retention for the selected wakeup pin */
        hal_ret = HAL_PWREx_EnableStandbyIORetention(pwr_gpio_port, pwr_gpio_pin);
        if (hal_ret != HAL_OK)
        {
            err = SID_ERROR_GENERIC;
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_standby_retention_disable(const uint32_t gpio_number)
{
    sid_error_t err;
    HAL_StatusTypeDef hal_ret;

    do
    {
        if (GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
        {
            err = SID_ERROR_NONE;
            break;
        }

        const uint32_t pwr_gpio_port = NUM_TO_PWR_GPIO_PORT(gpio_number);
        const uint16_t pwr_gpio_pin = (uint16_t)NUM_TO_GPIO_PIN(gpio_number);

        /* Disable GPIO retention for the selected wakeup pin */
        hal_ret = HAL_PWREx_DisableStandbyIORetention(pwr_gpio_port, pwr_gpio_pin);
        if (hal_ret != HAL_OK)
        {
            err = SID_ERROR_GENERIC;
            break;
        }

        /* Done */
        err = SID_ERROR_NONE;
    } while (0);

    return err;
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */

/*----------------------------------------------------------------------------*/

#if (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0)
SID_STM32_SPEED_OPTIMIZED sid_error_t sid_pal_gpio_ext_ifc_restore_output_after_standby(const uint32_t gpio_number, const sid_pal_gpio_output_t output_mode, const sid_pal_gpio_pull_t pull)
{
    if(GPIO_PORT_PIN_NOT_CONNECTED == gpio_number)
    {
        return SID_ERROR_NONE;
    }

    if ((output_mode > SID_PAL_GPIO_OUTPUT_OPEN_DRAIN) || (pull > SID_PAL_GPIO_PULL_DOWN))
    {
        return SID_ERROR_INVALID_ARGS;
    }

    GPIO_TypeDef * const st_port = NUM_TO_GPIO_ST_PORT(gpio_number);
    const uint32_t st_pin = NUM_TO_GPIO_PIN(gpio_number);
    SID_PAL_ASSERT(IS_GPIO_ALL_INSTANCE(st_port));
    SID_PAL_ASSERT(IS_GPIO_PIN(st_pin));
    gpio_clk_check_and_enable(st_port);

    /* Step 1 - set NSS pin as input - the state is still retained by Standby circuitry */
    SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d input mode to Input", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
    LL_GPIO_SetPinMode(st_port, st_pin, LL_GPIO_MODE_INPUT);

    /* Step 2 - capture current pin state */
    const uint8_t pin_value = ((st_port->IDR & st_pin) != 0x00u) ? GPIO_PIN_SET : GPIO_PIN_RESET;

    /* Step 3 - set output state identical to the current input state */
    if (pin_value != GPIO_PIN_RESET)
    {
        st_port->BSRR = (uint32_t)st_pin;
    }
    else
    {
        st_port->BRR = (uint32_t)st_pin;
    }


    /* Step 4 - configure NSS pin as output */
    /* Step 4.1 - Configure pull resistors */
    uint32_t pin_pull = LL_GPIO_PULL_NO;
    switch (pull)
    {
        case SID_PAL_GPIO_PULL_NONE:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Disable pull-up & pull-down on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            pin_pull = LL_GPIO_PULL_NO;
            break;

        case SID_PAL_GPIO_PULL_UP:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Enable pull-up on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            pin_pull = LL_GPIO_PULL_UP;
            break;

        case SID_PAL_GPIO_PULL_DOWN:
            SID_PAL_GPIO_STM32_LOG_DEBUG("Enable pull-down on P%s%d", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
            pin_pull = LL_GPIO_PULL_DOWN;
            break;

        default:
            SID_PAL_LOG_ERROR("Invalid GPIO pull mode: 0x%02X", pull);
            break;
    }
    LL_GPIO_SetPinPull(st_port, st_pin, pin_pull);

    /* Step 4.2 - set output type */
    uint32_t output_type;
    if (output_mode == SID_PAL_GPIO_OUTPUT_OPEN_DRAIN)
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d output mode to Open Drain", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        output_type = LL_GPIO_OUTPUT_OPENDRAIN;
    }
    else
    {
        SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d output mode to Push-Pull", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
        output_type = LL_GPIO_OUTPUT_PUSHPULL;
    }
    LL_GPIO_SetPinOutputType(st_port, st_pin, output_type);

    /* Step 4.3 - set pin as output */
    SID_PAL_GPIO_STM32_LOG_DEBUG("Set P%s%d direction to Output", NUM_TO_GPIO_PORT_STR(gpio_number), GET_GPIO_PIN_POSITION(NUM_TO_GPIO_PIN(gpio_number)));
    LL_GPIO_SetPinSpeed(st_port, st_pin, LL_GPIO_SPEED_FREQ_HIGH);
    LL_GPIO_SetPinMode(st_port, st_pin, LL_GPIO_MODE_OUTPUT);

    /* Step 5 - re-eanble retention in Standby mode */
    return sid_pal_gpio_ext_ifc_standby_retention_enable(gpio_number);
}
#endif /* (CFG_LPM_LEVEL != 0) && (CFG_LPM_STDBY_SUPPORTED != 0) */
